app/Models/CommentModel.php

SELECT `c`.*, `u`.`name`, `u`.`lastname`
FROM `commentaires` `c`
JOIN `utilisateur` `u` ON `c`.`user_id` = `u`.`iduser`
WHERE `c`.`post_id` = '56'
ORDER BY `c`.`created_at` DESC
---
    public function getComments($postId)
    {
        return $this->db->table('commentaires c')
        ->select('c.*, u.name, u.lastname')
        ->join('utilisateur u', 'c.user_id = u.iduser')
        ->where('c.post_id', $postId)
        ->orderBy('c.created_at', 'DESC')
        ->get()->getResultArray();