app/Models/FriendsModel.php

    public function getFriends($userId)
    {
        return $this->db->table('friends f')
            ->select('u.iduser, u.name, u.lastname, u.pdp')
            ->join('utilisateur u', 'f.friend_id = u.iduser', 'inner')
            ->orWhere('f.user_id', $userId)
            ->orWhere('f.friend_id', $userId)
            ->where('u.iduser !=', $userId)
            ->get()
            ->getResultArray();
---
SELECT `u`.`iduser`, `u`.`name`, `u`.`lastname`, `u`.`pdp`
FROM `friends` `f`
INNER JOIN `utilisateur` `u` ON `f`.`friend_id` = `u`.`iduser`
WHERE `f`.`user_id` = '37'
OR `f`.`friend_id` = '37'
AND `u`.`iduser` != '37'

    public function deleteFriends($userId, $friendIds)
    {
        $deletedCount = 0;
        foreach ($friendIds as $friendId) {
            $this->db->table('friends')
                ->where('user_id', $userId)
                ->where('friend_id', $friendId)
                ->delete();

            $this->db->table('friends')
                ->where('friend_id', $userId)
                ->where('user_id', $friendId)
                ->delete();
---
DELETE FROM `friends`
WHERE `user_id` = '37'
AND `friend_id` = '66'
DELETE FROM `friends`
WHERE `friend_id` = '37'
AND `user_id` = '66'