app/Models/PostModel.php

SELECT `posts`.*, `u`.`name`, `u`.`lastname`, `u`.`pdp`
FROM `posts`
JOIN `utilisateur` `u` ON `posts`.`user_id` = `u`.`iduser`
WHERE `posts`.`user_id` = '37'
OR `posts`.`user_id` IN (SELECT `friend_id` FROM `friends` WHERE `user_id` = '37')
ORDER BY `posts`.`created_at` DESC
---
    public function getPosts($userId)
    {
        return $this->db->table($this->table)
        ->select('posts.*, u.name, u.lastname, u.pdp')
        ->join('utilisateur u', 'posts.user_id = u.iduser')
        ->where('posts.user_id', $userId)
        ->orWhereIn('posts.user_id', function ($builder) use ($userId) {
            $builder->select('friend_id')->from('friends')->where('user_id', $userId);
        })
        ->orderBy('posts.created_at', 'DESC')
        ->get()->getResultArray();