app/Models/UtilisateursModel.php

    public function getFriends($userId)
    {
        return $this->db->table('friends')
            ->select('utilisateur.iduser, utilisateur.name, utilisateur.lastname, utilisateur.pdp')
            ->join('utilisateur', 'utilisateur.iduser = friends.friend_id')
            ->where('friends.user_id', $userId)
            ->orWhere('friends.friend_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT `utilisateur`.`iduser`, `utilisateur`.`name`, `utilisateur`.`lastname`, `utilisateur`.`pdp`
FROM `friends`
JOIN `utilisateur` ON `utilisateur`.`iduser` = `friends`.`friend_id`
WHERE `friends`.`user_id` = '37'
OR `friends`.`friend_id` = '37'